Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/the_seanad.html.txt.tmx
Source language: en
Languages: ga

source: Seanad Éireann is the senate of Ireland
ga: Is é Seanad Éireann seanad na hÉireann

source: It is the upper House of the Oireachtas (national Parliament) and has a number of important functions
ga: Is é dara Teach an Oireachtais é agus tá roinnt feidhmeanna tábhachtacha aige

source: Seanad Éireann is located in Dublin
ga: Tá Seanad Éireann suite i mBaile Átha Cliath

source: Seanad Éireann is composed of 60 members
ga: Tá 60 ball i Seanad Éireann

source: View a list of Senators listed by name and by panel
ga: Is féidir liosta de an Seandóirí a fheiceáil atá liostaithe de réir ainm agus de réir phainéil

source: The Taoiseach nominates 11 of the members and 49 members are elected in a Seanad election
ga: Ainmníonn an Taoiseach 11 de na baill agus toghtar 49 ball i dtoghchán de chuid an tSeanaid

source: One of the Senators takes the role of Cathaoirleach, (Speaker/Chairperson) of the Senators
ga: Glacann duine amháin de na Seanadóirí cúram an Chathaoirligh (Spéicéir/Cathaoirleach) na Seanadóirí

source: As the chairperson of the Seanad, the Cathaoirleach chairs the proceedings in the House and must act impartially
ga: Mar chathaoirleach ar an Seanad, déanann an Cathaoirleach cathaoirleacht ar imeachtaí sa Teach agus ní mór dó feidhmiú go neamhchlaonta

source: Senators are not officially separated into political parties
ga: Ní dhéantar Seanadóirí a scaradh go hoifigiúil de réir páirtithe polaitiúla

source: However, they usually divide into groups supporting and opposing Government business when voting on issues
ga: Ach de ghnáth téann siad sna grúpaí a thacaíonn le gnóthaí an Rialtais nó a chuireann ina n-aghaidh nuair a bhítear ag vótáil ar cheisteanna

source: A Sub-Committee of the Committee on Procedure and Privileges of Seanad Éireann was established to review and make recommendations on the current and future composition and functions of the Seanad in Ireland
ga: Bunaíodh Fo-choiste de Choiste Nós Imeachta agus Pribhléidí Sheanad Éireann chun athbhreithniú agus moltaí a dhéanamh maidir le leagan amach agus feidhm an tSeanaid in Éirinn i láthair na huaire agus amach anseo

source: In 2004 it produced a Report on Seanad Reform (pdf)
ga: I 2004, chuir sé Tuarascáil um Leasú an tSeanaid (pdf) i dtoll a chéile
